In [1]:
import matplotlib.pyplot as plt
import numpy as np
import pandas as pd
from sklearn.preprocessing import MinMaxScaler, OrdinalEncoder
from sklearn.model_selection import train_test_split as tts
import seaborn as sns
import math

In [36]:
df = pd.read_excel("C:\\Users\\Dell\\Desktop\\CSM_dataset.xlsx")
df.head()

,Movie,Year,Ratings,Genre,Gross,Budget,Screens,Sequel,Sentiment,Views,Likes,Dislikes,Comments,Aggregate Followers
0,13 Sins,2014,6.3,8,9130,4000000.0,45.0,1,0,3280543,4632,425,636,1120000.0
1,22 Jump Street,2014,7.1,1,192000000,50000000.0,3306.0,2,2,583289,3465,61,186,12350000.0
2,3 Days to Kill,2014,6.2,1,30700000,28000000.0,2872.0,1,0,304861,328,34,47,483000.0
3,300: Rise of an Empire,2014,6.3,1,106000000,110000000.0,3470.0,2,0,452917,2429,132,590,568000.0
4,A Haunted House 2,2014,4.7,8,17300000,3500000.0,2310.0,2,0,3145573,12163,610,1082,1923800.0

In [37]:
df = df.set_axis(labels = list(range(14)), axis = 1)
df

,0,1,2,3,4,5,6,7,8,9,10,11,12,13
0,13 Sins,2014,6.3,8,9130,4000000.0,45.0,1,0,3280543,4632,425,636,1120000.0
1,22 Jump Street,2014,7.1,1,192000000,50000000.0,3306.0,2,2,583289,3465,61,186,12350000.0
2,3 Days to Kill,2014,6.2,1,30700000,28000000.0,2872.0,1,0,304861,328,34,47,483000.0
3,300: Rise of an Empire,2014,6.3,1,106000000,110000000.0,3470.0,2,0,452917,2429,132,590,568000.0
4,A Haunted House 2,2014,4.7,8,17300000,3500000.0,2310.0,2,0,3145573,12163,610,1082,1923800.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
226,Child 44,2015,6.4,4,1210000,50000000.0,66.0,1,4,3701061,9325,641,1859,NaN
227,Aloha,2015,5.5,15,21000000,37000000.0,2815.0,1,13,7119456,18803,1128,2290,NaN
228,Unfinished Business,2015,5.4,8,10200000,35000000.0,2777.0,1,7,3450614,6823,325,409,NaN
229,War Room,2015,5.4,1,12300000,3000000.0,NaN,1,10,66872,400,67,201,NaN
230,The Gallows,2015,4.4,15,22600000,100000.0,2720.0,1,-5,659772,2841,431,606,NaN

In [38]:
print((df.isna().sum()/len(df))*100)

0      0.000000
1      0.000000
2      0.000000
3      0.000000
4      0.000000
5      0.432900
6      4.329004
7      0.000000
8      0.000000
9      0.000000
10     0.000000
11     0.000000
12     0.000000
13    15.151515
dtype: float64

In [39]:
na_value = list(range(1,14))
for i in na_value:
    df[i] =pd.to_numeric(df[i], errors = "coerce" )

In [40]:
na_value =[5,6,13]
for i in na_value :
    df.dropna(subset = [i], inplace = True)
print((df.isna().sum()/len(df))*100)

0     0.0
1     0.0
2     0.0
3     0.0
4     0.0
5     0.0
6     0.0
7     0.0
8     0.0
9     0.0
10    0.0
11    0.0
12    0.0
13    0.0
dtype: float64

In [41]:
df.head()

,0,1,2,3,4,5,6,7,8,9,10,11,12,13
0,13 Sins,2014,6.3,8,9130,4000000.0,45.0,1,0,3280543,4632,425,636,1120000.0
1,22 Jump Street,2014,7.1,1,192000000,50000000.0,3306.0,2,2,583289,3465,61,186,12350000.0
2,3 Days to Kill,2014,6.2,1,30700000,28000000.0,2872.0,1,0,304861,328,34,47,483000.0
3,300: Rise of an Empire,2014,6.3,1,106000000,110000000.0,3470.0,2,0,452917,2429,132,590,568000.0
4,A Haunted House 2,2014,4.7,8,17300000,3500000.0,2310.0,2,0,3145573,12163,610,1082,1923800.0

In [42]:
cont_attr = list(range(1,14))
min_max_scaler = MinMaxScaler()
df[cont_attr] = min_max_scaler.fit_transform(df[cont_attr])
print(df.head())

                       0    1         2    3         4         5         6   \
0                 13 Sins  0.0  0.571429  0.5  0.000010  0.015724  0.009949
1          22 Jump Street  0.0  0.714286  0.0  0.298598  0.199776  0.764461
2          3 Days to Kill  0.0  0.553571  0.0  0.047741  0.111751  0.664044
3  300: Rise of an Empire  0.0  0.571429  0.0  0.164849  0.439843  0.802406
4       A Haunted House 2  0.0  0.285714  0.5  0.026901  0.013724  0.534012

         7         8         9         10        11        12        13
0  0.000000  0.567164  0.100528  0.012498  0.030444  0.016578  0.036061
1  0.166667  0.597015  0.017857  0.009348  0.004370  0.004848  0.397981
2  0.000000  0.567164  0.009323  0.000882  0.002436  0.001225  0.015532
3  0.166667  0.567164  0.013861  0.006552  0.009456  0.015379  0.018271
4  0.166667  0.567164  0.096391  0.032821  0.043696  0.028204  0.061966

In [43]:
y = np.array(df.pop(4))
x = np.array(x)

In [44]:
print("shape of X >>> ",x.shape)
print("shape of y >>> ",y.shape)

shape of X >>>  (187, 12)
shape of y >>>  (187,)

In [46]:
x_train, x_test , y_train, y_test = tts(x,y, test_size = 0.2)

In [47]:
from sklearn.linear_model import LinearRegression
lr = LinearRegression()
lr.fit(x_train, y_train)
y_pred = lr.predict(x_test)

In [49]:
score = lr.score(x_test , y_test)
print(score)

0.44314343698760716

# classification

In [4]:
!git init

Reinitialized existing Git repository in C:/Users/Dell/Desktop/jupyter/hamrah_aval/example01/.git/

In [5]:
!git add .\README.md

In [6]:
!git commit -m "first commit"

[master (root-commit) df984d5] first commit
 1 file changed, 0 insertions(+), 0 deletions(-)
 create mode 100644 README.md

In [7]:
!git remote add origin https://github.com/am3r4hmadi/git_github.git

In [14]:
!git push -u origin master

branch 'master' set up to track 'origin/master'.

Everything up-to-date

In [12]:
!git config --global user.name "amir"

In [13]:
!git config --global user.email "amir@gmail.com"

In [17]:
amir = "amir"
print(amir)
print(amir)

amir
amir

In [18]:
!git pull

Already up to date.